stow/emacs/.emacs.d/config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Omran Al Teneiji
#+PROPERTY: header-args:emacs-lisp :tangle init.el
#+STARTUP: overview indent

* Early Init
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:

#+begin_src emacs-lisp
;;; early-init.el -*- lexical-binding: t -*-
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6
      package-enable-at-startup nil)

(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(horizontal-scroll-bars) default-frame-alist)
(push '(background-color . "#282828") default-frame-alist)
(push '(foreground-color . "#ebdbb2") default-frame-alist)
(push '(cursor-color . "#fe8019") default-frame-alist)

(setq native-comp-async-report-warnings-errors 'silent)
#+end_src

* Bootstrap

#+begin_src emacs-lisp
;;; init.el -*- lexical-binding: t -*-

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
                         user-emacs-directory))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t
      use-package-always-defer t)
#+end_src

* Performance

#+begin_src emacs-lisp
(setq read-process-output-max (* 4 1024 1024))
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 32 1024 1024)
                  gc-cons-percentage 0.1)))

(use-package gcmh
  :demand t
  :config
  (gcmh-mode 1)
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 64 1024 1024)))
#+end_src

* Core Defaults

#+begin_src emacs-lisp
(use-package emacs
  :straight (:type built-in)
  :demand t
  :init
  (setq inhibit-startup-message t
        initial-scratch-message nil
        ring-bell-function 'ignore
        use-short-answers t
        make-backup-files nil
        auto-save-default nil
        create-lockfiles nil
        use-dialog-box nil
        scroll-margin 8
        scroll-conservatively 101
        scroll-preserve-screen-position t)
  :config
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)
  (column-number-mode 1)
  (global-auto-revert-mode 1)
  (set-face-attribute 'default nil :family "TerminessNerdFont" :height 140))
#+end_src

* Theme

#+begin_src emacs-lisp
(use-package gruvbox-theme
  :demand t
  :config
  (load-theme 'gruvbox-dark-hard t))
#+end_src

* Evil

#+begin_src emacs-lisp
(use-package evil
  :demand t
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-split-window-below t
        evil-vsplit-window-right t)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :demand t
  :config
  (evil-collection-init))
#+end_src

* Completion Stack

#+begin_src emacs-lisp
(use-package vertico
  :demand t
  :init (vertico-mode 1))

(use-package orderless
  :demand t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package marginalia
  :demand t
  :init (marginalia-mode 1))

(use-package consult
  :demand t
  :bind (("C-s" . consult-line)
         ("C-x b" . consult-buffer)
         ("M-s r" . consult-ripgrep)
         ("M-g g" . consult-goto-line)))

(use-package corfu
  :demand t
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.2)
  (corfu-auto-prefix 2)
  :init (global-corfu-mode 1))

(use-package embark
  :demand t
  :bind (("C-." . embark-act)
         ("C-;" . embark-dwim)
         ("C-h B" . embark-bindings)))

(use-package embark-consult
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))

(use-package wgrep
  :defer t)

(use-package which-key
  :demand t
  :config
  (which-key-mode 1)
  (setq which-key-idle-delay 0.3))
#+end_src

* Org-Mode Core

#+begin_src emacs-lisp
(use-package org
  :straight (:type built-in)
  :hook (org-mode . visual-line-mode)
  :config
  (setq org-directory "~/org"
        org-default-notes-file "~/org/inbox.org"
        org-agenda-files '("~/org/inbox.org" "~/org/todo.org"
                           "~/org/projects.org" "~/org/habits.org")
        org-log-done 'time
        org-log-into-drawer t
        org-return-follows-link t
        org-confirm-babel-evaluate nil
        org-startup-indented t
        org-hide-emphasis-markers t
        org-pretty-entities t
        org-ellipsis " ..."
        org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-preserve-indentation t
        org-image-actual-width '(600))

  ;; Babel languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (python . t)
     (C . t)))

  ;; Structure templates
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("cc" . "src C"))

  ;; TODO keywords
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "DOING(d)" "BLOCKED(b@/!)" "|" "DONE(!)" "DROPPED(x@/!)")))
  (setq org-todo-keyword-faces
        '(("TODO"    . (:foreground "#fb4934" :weight bold))
          ("NEXT"    . (:foreground "#b8bb26" :weight bold))
          ("DOING"   . (:foreground "#fe8019" :weight bold))
          ("BLOCKED" . (:foreground "#fabd2f" :weight bold))
          ("DONE"    . (:foreground "#928374" :weight bold))
          ("DROPPED" . (:foreground "#928374" :weight bold))))

  ;; Tags
  (setq org-tag-alist
        '((:startgroup) ("@home" . ?h) ("@work" . ?w) ("@errands" . ?e) (:endgroup)
          (:startgroup) ("deep" . ?d) ("shallow" . ?s) (:endgroup)
          ("learning" . ?l) ("project" . ?P) ("reading" . ?r)))

  ;; Refile
  (setq org-refile-targets
        '(("~/org/projects.org" :maxlevel . 3)
          ("~/org/someday.org" :level . 1)
          ("~/org/archive/archive.org" :maxlevel . 2)))
  (setq org-refile-use-outline-path 'file
        org-outline-path-complete-in-steps nil
        org-refile-allow-creating-parent-nodes 'confirm)

  ;; Capture
  (setq org-capture-templates
        '(("i" "Inbox" entry (file+headline "~/org/inbox.org" "Inbox")
           "* TODO %?\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n" :empty-lines 1)
          ("t" "Task" entry (file+headline "~/org/inbox.org" "Tasks")
           "* TODO %?\n  :PROPERTIES:\n  :CREATED: %U\n  :CONTEXT: %a\n  :END:\n" :empty-lines 1)
          ("n" "Note" entry (file+headline "~/org/inbox.org" "Notes")
           "* %? :note:\n  %U\n" :empty-lines 1)
          ("j" "Journal" entry (file+olp+datetree "~/org/journal.org")
           "* %<%H:%M> %?\n" :tree-type week)
          ("b" "Bookmark" entry (file+headline "~/org/bookmarks.org" "Unsorted")
           "* [[%^{URL}][%^{Title}]] :bookmark:\n  %U\n  %?\n" :empty-lines 1)
          ("H" "Habit" entry (file "~/org/habits.org")
           "* TODO %?\n  SCHEDULED: %^t\n  :PROPERTIES:\n  :STYLE: habit\n  :END:\n" :empty-lines 1)))

  ;; Agenda
  (setq org-agenda-start-with-log-mode t
        org-agenda-window-setup 'current-window
        org-agenda-span 'day
        org-deadline-warning-days 7
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t)

  (setq org-agenda-custom-commands
        '(("d" "Dashboard"
           ((agenda "" ((org-agenda-span 'day)
                        (org-agenda-overriding-header "Today")))
            (todo "DOING" ((org-agenda-overriding-header "In Progress")))
            (todo "NEXT" ((org-agenda-overriding-header "Next Actions")))
            (todo "BLOCKED" ((org-agenda-overriding-header "Blocked")))
            (tags "inbox" ((org-agenda-overriding-header "Inbox (process)")))))
          ("W" "Weekly Review"
           ((agenda "" ((org-agenda-span 7)
                        (org-agenda-overriding-header "This Week")))
            (todo "BLOCKED" ((org-agenda-overriding-header "Blocked")))
            (todo "TODO" ((org-agenda-overriding-header "All TODOs")))))))

  ;; Habit
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 40)

  ;; Clock
  (setq org-clock-persist 'history
        org-clock-into-drawer t
        org-clock-out-remove-zero-time-clocks t)
  (org-clock-persistence-insinuate))

(use-package org-modern
  :hook (org-mode . org-modern-mode))

(use-package org-super-agenda
  :after org
  :demand t
  :config
  (org-super-agenda-mode)
  (setq org-super-agenda-groups
        '((:name "Overdue" :deadline past :order 0)
          (:name "Due Today" :deadline today :order 1)
          (:name "In Progress" :todo "DOING" :order 2)
          (:name "Next Actions" :todo "NEXT" :order 3)
          (:name "Habits" :habit t :order 8)
          (:name "Blocked" :todo "BLOCKED" :order 9)
          (:discard (:anything t)))))
#+end_src

* Org-Roam (Zettelkasten)

#+begin_src emacs-lisp
(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/org/roam/"))
  (org-roam-completion-everywhere t)
  (org-roam-database-connector 'sqlite-builtin)
  (org-roam-dailies-directory "journal/")
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (org-roam-db-autosync-mode)
  (setq org-roam-node-display-template
        (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

  (setq org-roam-capture-templates
        '(("d" "Default" plain "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: \n#+date: %U\n")
           :unnarrowed t)
          ("s" "Code Snippet" plain
           "* Source\n%^{Language|shell|emacs-lisp|python|c}\n\n* Code\n\n#+begin_src %\\1\n%?\n#+end_src\n\n* Explanation\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :snippet:\n#+date: %U\n")
           :unnarrowed t)
          ("c" "Concept" plain
           "* Definition\n\n%?\n\n* Related Concepts\n\n- \n\n* Links\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :concept:\n#+date: %U\n")
           :unnarrowed t)
          ("w" "Tutorial Walkthrough" plain
           "* Prerequisites\n\n- \n\n* Steps\n\n1. %?\n\n* Troubleshooting\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :tutorial:\n#+date: %U\n")
           :unnarrowed t)
          ("l" "Literature Note" plain
           "* Source\n\n- Author: %^{Author}\n- Title: ${title}\n- URL: %^{URL}\n\n* Summary\n\n%?\n\n* Key Ideas\n\n- \n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :literature:\n#+date: %U\n")
           :unnarrowed t)
          ("f" "Fleeting" plain "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                              "#+title: ${title}\n#+filetags: :fleeting:\n#+date: %U\n")
           :unnarrowed t)))

  (setq org-roam-dailies-capture-templates
        '(("d" "Default" entry "* %<%H:%M> %?"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))
          ("t" "Task" entry "* TODO %?\n  SCHEDULED: %t\n"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n")))))

(use-package org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t))
#+end_src

* Org-Protocol

#+begin_src emacs-lisp
(require 'org-protocol)
(add-to-list 'org-capture-templates
             '("W" "Web Capture" entry
               (file+headline "~/org/inbox.org" "Web")
               "* TODO %:annotation\n  %U\n  %:initial\n  %?\n"
               :empty-lines 1))
#+end_src

* Auto-Tangle

#+begin_src emacs-lisp
(defun my/org-babel-tangle-config ()
  "Tangle config.org on save."
  (when (string-equal (buffer-file-name)
                      (expand-file-name "config.org" user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'after-save-hook #'my/org-babel-tangle-config nil t)))
#+end_src

* Git

#+begin_src emacs-lisp
(use-package magit
  :bind ("C-x g" . magit-status))

(use-package git-timemachine
  :defer t)
#+end_src

* RSS

#+begin_src emacs-lisp
(use-package elfeed
  :bind ("C-x w" . elfeed)
  :config
  (setq elfeed-search-filter "@1-week-ago +unread"))

(use-package elfeed-org
  :after elfeed
  :demand t
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files (list "~/org/elfeed.org")))
#+end_src

* AI (gptel)

#+begin_src emacs-lisp
(use-package gptel
  :bind (("C-c g" . gptel-send)
         ("C-c G" . gptel-menu))
  :config
  (setq gptel-model 'claude-sonnet-4-20250514
        gptel-default-mode 'org-mode)
  ;; Gemini backend
  (gptel-make-gemini "Gemini"
    :key (lambda () (getenv "GEMINI_API_KEY"))
    :stream t))
#+end_src

* LSP (eglot)

#+begin_src emacs-lisp
(use-package eglot
  :straight (:type built-in)
  :hook ((python-mode . eglot-ensure)
         (c-mode . eglot-ensure)
         (sh-mode . eglot-ensure)))
#+end_src

* Terminal

#+begin_src emacs-lisp
(use-package vterm
  :bind ("C-c t" . vterm)
  :config
  (setq vterm-max-scrollback 10000))
#+end_src

* File Management

#+begin_src emacs-lisp
(use-package dired
  :straight (:type built-in)
  :config
  (setq dired-listing-switches "-alh --group-directories-first"
        dired-dwim-target t
        dired-auto-revert-buffer t))
#+end_src

* Server

#+begin_src emacs-lisp
(use-package server
  :straight (:type built-in)
  :config
  (unless (server-running-p) (server-start)))
#+end_src
